app/controllers/cat_rental_requests_controller.rb

  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    cat_id = params[:cat_id]
    @cats_list = Cat.all

    if @cat_rental_request.save
---
SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2019-08-06"], ["end_date", "2019-08-08"], ["created_at", "2019-08-06 22:51:57.571400"], ["updated_at", "2019-08-06 22:51:57.571400"]]

  def index
    @cat_rental_request = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"

  def approve
    @cat_rental_request = CatRentalRequest.find_by(id: params[:id])
    @cat = Cat.find_by(id: @cat_rental_request.cat_id)
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def deny
    @cat_rental_request = CatRentalRequest.find_by(id: params[:id])
    @cat = Cat.find_by(id: @cat_rental_request.cat_id)
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]