app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-08-07 19:31:12.623761"], ["id", 1]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-08-07 19:31:12.630830"], ["id", 3]]
---
  def approve!
    ActiveRecord::Base.transaction do
      self.status = "APPROVED"
      self.save

      self.overlapping_pending_requests.each do |overlapping_pending_request|
        overlapping_pending_request.status = "DENIED"
        overlapping_pending_request.save

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-08-07 20:07:06.815646"], ["id", 1]]
---
  def deny!
    ActiveRecord::Base.transaction do
      self.status = "DENIED"
      self.save